#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/armin-mesic/gh-actions-demo/runs/run-cK45Sf7cEvVn1rpc

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 0s [id=ami-00d27ac4138d503ce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-00d27ac4138d503ce"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.small"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 1 of 1 estimated
           $16.56/mo +$16.56

------------------------------------------------------------------------

Organization Policy Check:

===================== Results for policy set: sentinel-demo ====================

Sentinel Result: false

This result means that one or more Sentinel policies failed. More than likely,
this was due to the discovery of violations by the main rule and other
sub-rules. Please see the details of the policies executed below to find the
violation(s), which is usually indicated by a rule with a false boolean value,
or non-zero collection data.

4 policies evaluated.

## Policy 1: sentinel-demo/enforce-mandatory-tags (advisory)

Result: false (allowed failure based on level)

Description:
  This policy uses the Sentinel tfplan/v2 import to require that  specified AWS resources have all mandatory tags

Print messages:

aws_instance.web has tags that is missing, null, or is not a map or a list. It should have had these items: [Name, ttl, owner, se-region, purpose, terraform]

./enforce-mandatory-tags.sentinel:35:1 - Rule "main"
  Description:
    Main rule

  Value:
    false

## Policy 2: sentinel-demo/restrict-availability-zones (hard-mandatory)

Result: false

Description:
  This policy uses the Sentinel tfplan/v2 import to restrict  the availability zones used by EC2 instances.  This is an easier way to restrict regions than to restrict  the region of the AWS provider since that requires the  tfconfig/v2 import.

Print messages:

aws_instance.web has availability_zone with value null that is not in the allowed list: [us-west-2a, us-west-2b, us-west-2c]

./restrict-availability-zones.sentinel:26:1 - Rule "main"
  Description:
    Main rule

  Value:
    false

## Policy 3: sentinel-demo/protect-against-rds-instance-deletion (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 import to prevent deletion  of RDS instances that have `deletion_protection` set to true.  Note that it calls the `filter_attribute_was_value()` function which passes  `rc.change.before` instead of `rc` to the `evaluate_attribute()` function  which converts `rc` to `rc.change.after`.

./protect-against-rds-instance-deletion.sentinel:30:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 4: sentinel-demo/restrict-ec2-instance-type (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 import to require that  all EC2 instances have instance types from an allowed list

./restrict-ec2-instance-type.sentinel:24:1 - Rule "main"
  Description:
    Main rule

  Value:
    true



```

</details>

*Pushed by: @Arminmsg, Action: `pull_request`*